Repository: sharonkudi/FYP-GROUP_8
Catalog: bus_app/lib/l10n/app_*.arb
Languages: ms

source: Settings
ms: Tetapan

source: Language
ms: Bahasa

source: English
ms: Bahasa Inggeris

source: Malay
ms: Bahasa Melayu

source: Accessibility
ms: Aksesibiliti

source: Font Size
ms: Saiz Fon

source: Small
ms: Kecil

source: Medium
ms: Sederhana

source: Large
ms: Besar

source: Icon Size
ms: Saiz Ikon

source: Mode
ms: Mod

source: Save
ms: Simpan

source: Destination
ms: Destinasi

# selectDestination
source: Please select a destination.
ms: Sila pilih destinasi.

source: Bus Stops near me
ms: Perhentian Bas berhampiran

source: View All
ms: Lihat Semua

source: View
ms: Lihat

source: Home
ms: Utama

source: List Form
ms: Borang Senarai

source: Map Form
ms: Borang Peta

source: From
ms: Dari

source: To
ms: Ke

source: Available Buses
ms: Bas Tersedia

source: Available
ms: Tersedia

source: Fare Estimator
ms: Penganggar Tambang

source: Total Fare
ms: Jumlah Tambang

source: Back
ms: Kembali

source: View Bus
ms: Lihat Bas

source: Bus Route
ms: Laluan Bas

source: Next Bus
ms: Bas Seterusnya

source: View Map
ms: Lihat Peta

source: Arrived
ms: Tiba

source: Passed
ms: Lalu

source: Upcoming
ms: Akan Datang

source: No Internet Connection
ms: Tiada Sambungan Internet

# offlineViewMessage
source: Please check your connection or continue with offline view.
ms: Sila semak sambungan anda atau teruskan dengan paparan luar talian.

source: Retry
ms: Cuba Semula

# viewOfflineMap
source: View Offline System Map
ms: Lihat Peta Sistem Luar Talian

source: Offline Map
ms: Peta Luar Talian

source: Offline System Map
ms: Peta Sistem Luar Talian

source: Offline Bus Schedule
ms: Jadual Bas Luar Talian

source: Adults
ms: Dewasa

source: Children / Seniors
ms: Kanak-kanak / Warga Emas

source: Schedule
ms: Jadual

source: Features
ms: Ciri-ciri

source: Duration
ms: Tempoh

source: Driver
ms: Pemandu

# busNumber
source: Bus No
ms: No Bas

source: Unassigned
ms: Belum Ditetapkan

source: Take Bus A to Kianggeh
ms: Naik Bas A ke Kianggeh

source: Arrive at Kianggeh at
ms: Tiba di Kianggeh pada

source: Transfer to Bus B at Kianggeh
ms: Tukar ke Bas B di Kianggeh

# continueToYayasanOrMoF
source: Continue to Yayasan Complex or Ministry of Finance
ms: Teruskan ke Kompleks Yayasan atau Kementerian Kewangan

source: Take Bus B to Kianggeh
ms: Naik Bas B ke Kianggeh

# transferToBusAAtTheMall
source: Transfer to Bus A at The Mall Gadong
ms: Tukar ke Bas A di The Mall Gadong

# continueToPBSchoolOrMall
source: Continue to PB School, Ong Sum Ping, or loop at The Mall Gadong
ms: Teruskan ke Sekolah PB, Ong Sum Ping, atau pusing di The Mall Gadong

source: Transit Info
ms: Maklumat Transit

# busPrefix
source: Bus
ms: Bas

# aircond
source: Air Conditioning
ms: Penyaman Udara

source: Wheelchair Lifts
ms: Lif Kerusi Roda

source: Wheelchair Space
ms: Ruang Kerusi Roda

# duration_5_10
source: Estimated 5–10 minutes for each stop
ms: Anggaran 5–10 minit bagi setiap hentian

# duration_5_15
source: Estimated 5–15 minutes for each stop
ms: Anggaran 5–15 minit bagi setiap hentian

# duration_10_15
source: Estimated 10–15 minutes for each stop
ms: Anggaran 10–15 minit bagi setiap hentian

# duration_10_20
source: Estimated 10–20 minutes for each stop
ms: Anggaran 10–20 minit bagi setiap hentian

source: Close
ms: Tutup

source: Bus
ms: Bas

source: Scheduled Time
ms: Waktu Jadual

source: Next Stop
ms: Perhentian Seterusnya

source: Status
ms: Kedudukan

source: Unknown
ms: Tidak diketahui

source: Bus Features
ms: Ciri-ciri Bas

source: Transit Required
ms: Perlu Transit

# transitDescription
source: Drop off at {stop} and walk (~5 min) to continue your journey. Extra Fare: BND 1.00
ms: Turun di {stop} dan berjalan (~5 min) untuk meneruskan perjalanan anda. Tambahan Tambang: BND 1.00

# statusArrived
source: ✅ Arrived at destination
ms: ✅ Telah sampai destinasi

# statusArrivingSoon
source: 🟢 Arriving Soon ({minutes} min)
ms: 🟢 Sedang menghampiri ({minutes} minit)

# statusETA
source: 🕓 ETA {minutes} min
ms: 🕓 Jangkaan tiba {minutes} minit
